Repository: ChristianWia/rfrench
Catalog: data.table/vignettes/*/po/datatable-*-usage.Rmd-*.po
Languages: fr

source: The above is just a short introduction of the power of `.SD` in facilitating beautiful, efficient code in `data.table`!
fr: Tout ceci n'est simplement qu'une brève introduction sur la puissance de `.SD` qui facilite la beauté et l'efficacité du code dans `data.table` !

source: title: "Using .SD for Data Analysis" date: "`r Sys.Date()`" output: markdown::html_format: options: toc: true number_sections: true meta: css: [default, css/toc.css] vignette: > %\VignetteIndexEntry{Using .SD for Data Analysis} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}
fr: title: "Utiliser .SD pour l’analyse de données" date: "`r Sys.Date()`" output: markdown::html_format: options: toc: true number_sections: true meta: css: [default, ../css/toc.css] vignette: > %\VignetteIndexEntry{Utiliser .SD pour l’analyse de données} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}

source: # Chunk args: r identify_factors # teamIDBR: Team ID used by Baseball Reference website # teamIDlahman45: Team ID used in Lahman database version 4.5 # teamIDretro: Team ID used by Retrosheet fkt = c('teamIDBR', 'teamIDlahman45', 'teamIDretro') # confirm that they're stored as `character` str(Teams[ , ..fkt])
fr: # Chunk args: r identify_factors # teamIDBR: identifiant du team utilisé par le site de référence du Baseball # teamIDlahman45: identifiant du team utilisé dans la base de données Lahman version 4.5 # teamIDretro: identifiant du team utilisé par Retrosheet fkt = c('teamIDBR', 'teamIDlahman45', 'teamIDretro') # confirmation qu’ils sont enregistrés comme `character` str(Teams[ , ..fkt])

source: # Chunk args: r assign_factors Teams[ , names(.SD) := lapply(.SD, factor), .SDcols = patterns('teamID')] # print out the first column to demonstrate success head(unique(Teams[[fkt[1L]]]))
fr: # Chunk args: r assign_factors Teams[ , names(.SD) := lapply(.SD, factor), .SDcols = patterns('teamID')] # impression des premières colonnes pour montrer que c’est correct head(unique(Teams[[fkt[1L]]]))

source: # Chunk args: r sd_as_logical fct_idx = Teams[, which(sapply(.SD, is.factor))] # column numbers to show the class changing str(Teams[[fct_idx[1L]]]) Teams[ , names(.SD) := lapply(.SD, as.character), .SDcols = is.factor] str(Teams[[fct_idx[1L]]])
fr: # Chunk args: r sd_as_logical fct_idx = Teams[, which(sapply(.SD, is.factor))] # numéros de colonnes montrant un changement de classe str(Teams[[fct_idx[1L]]]) Teams[ , names(.SD) := lapply(.SD, as.character), .SDcols = is.factor] str(Teams[[fct_idx[1L]]])

source: # Chunk args: r sd_for_lm, cache = FALSE, fig.cap="Fit OLS coefficient on W, various specifications, depicted as bars with distinct colors." # this generates a list of the 2^k possible extra variables # for models of the form ERA ~ G + (...) extra_var = c('yearID', 'teamID', 'G', 'L') models = unlist( lapply(0L:length(extra_var), combn, x = extra_var, simplify = FALSE), recursive = FALSE ) # here are 16 visually distinct colors, taken from the list of 20 here: # https://sashat.me/2017/01/11/list-of-20-simple-distinct-colors/ col16 = c('#e6194b', '#3cb44b', '#ffe119', '#0082c8', '#f58231', '#911eb4', '#46f0f0', '#f032e6', '#d2f53c', '#fabebe', '#008080', '#e6beff', '#aa6e28', '#fffac8', '#800000', '#aaffc3') par(oma = c(2, 0, 0, 0)) lm_coef = sapply(models, function(rhs) { # using ERA ~ . and data = .SD, then varying which # columns are included in .SD allows us to perform this # iteration over 16 models succinctly. # coef(.)['W'] extracts the W coefficient from each model fit Pitching[ , coef(lm(ERA ~ ., data = .SD))['W'], .SDcols = c('W', rhs)] }) barplot(lm_coef, names.arg = sapply(models, paste, collapse = '/'), main = 'Wins Coefficient\nWith Various Covariates', col = col16, las = 2L, cex.names = 0.8)
fr: # Chunk args: r sd_for_lm, cache = FALSE, fig.cap="Ajustement OLS du coefficient W, différentes spécifications, représentées sous forme de barres de couleurs différentes." # ceci génère une liste des 2^k variables extras # fpour des modèles du style ERA ~ G + (...) extra_var = c('yearID', 'teamID', 'G', 'L') models = unlist( lapply(0L:length(extra_var), combn, x = extra_var, simplify = FALSE), recursive = FALSE ) # voici 16 couleurs visuellement distinctes choisies depuis une liste de 20 ici: # https://sashat.me/2017/01/11/list-of-20-simple-distinct-colors/ col16 = c('#e6194b', '#3cb44b', '#ffe119', '#0082c8', '#f58231', '#911eb4', '#46f0f0', '#f032e6', '#d2f53c', '#fabebe', '#008080', '#e6beff', '#aa6e28', '#fffac8', '#800000', '#aaffc3') par(oma = c(2, 0, 0, 0)) lm_coef = sapply(models, function(rhs) { # utilisation de ERA ~ . and data = .SD, et puis variation de quelles # colonnes sont incluses dans .SD nous permet de faire cette # iteration sur 16 modèles de manière succincte. # coef(.)['W'] extrait le coefficient W de chaque modèle Pitching[ , coef(lm(ERA ~ ., data = .SD))['W'], .SDcols = c('W', rhs)] }) barplot(lm_coef, names.arg = sapply(models, paste, collapse = '/'), main = 'Wins Coefficient\nWith Various Covariates', col = col16, las = 2L, cex.names = 0.8)

source: # Chunk args: r conditional_join # to exclude pitchers with exceptional performance in a few games, # subset first; then define rank of pitchers within their team each year # (in general, we should put more care into the 'ties.method' of frank) Pitching[G > 5, rank_in_team := frank(ERA), by = .(teamID, yearID)] Pitching[rank_in_team == 1, team_performance := Teams[.SD, Rank, on = c('teamID', 'yearID')]]
fr: # Chunk args: r conditional_join # pour exclure les Pitchers ayant des performances exceptionnelles dans quelques jeux, # créer un sous-ensemble ; ensuite définir le rang des Pitchers dans leur équipe chaque # année (en général, nous devons nous focaliser aussi sur 'ties.method' de frank) Pitching[G > 5, rank_in_team := frank(ERA), by = .(teamID, yearID)] Pitching[rank_in_team == 1, team_performance := Teams[.SD, Rank, on = c('teamID', 'yearID')]]

source: # Chunk args: r group_sd_last # the data is already sorted by year; if it weren't # we could do Teams[order(yearID), .SD[.N], by = teamID] Teams[ , .SD[.N], by = teamID]
fr: # Chunk args: r group_sd_last # les données sont déjà triées par année ; si elles ne l’étaient pas # nous pourrions faire Teams[order(yearID), .SD[.N], by = teamID] Teams[ , .SD[.N], by = teamID]

source: # Chunk args: r group_lm, results = 'hide', fig.cap="A histogram depicting the distribution of fitted coefficients. It is vaguely bell-shaped and concentrated around -.2" # Overall coefficient for comparison overall_coef = Pitching[ , coef(lm(ERA ~ W))['W']] # use the .N > 20 filter to exclude teams with few observations Pitching[ , if (.N > 20L) .(w_coef = coef(lm(ERA ~ W))['W']), by = teamID ][ , hist(w_coef, 20L, las = 1L, xlab = 'Fitted Coefficient on W', ylab = 'Number of Teams', col = 'darkgreen', main = 'Team-Level Distribution\nWin Coefficients on ERA')] abline(v = overall_coef, lty = 2L, col = 'red')
fr: # Chunk args: r group_lm, results = 'hide', fig.cap="Histogramme de la distribution des coefficients ajustés. It se rapproche d’une courbe en cloche centrée autour de -.2" # Coefficients généraux pour comparaison overall_coef = Pitching[ , coef(lm(ERA ~ W))['W']] # utilisation d’un filtre .N > 20 pour exclure les équipes où il y a peu d’observations Pitching[ , if (.N > 20L) .(w_coef = coef(lm(ERA ~ W))['W']), by = teamID ][ , hist(w_coef, 20L, las = 1L, xlab = 'Fitted Coefficient on W', ylab = 'Number of Teams', col = 'darkgreen', main = 'Team-Level Distribution\nWin Coefficients on ERA')] abline(v = overall_coef, lty = 2L, col = 'red')
