Repository: ChristianWia/rfrench
Catalog: data.table/vignettes/*/po/datatable-secondary-indices-and-auto-indexing.Rmd-*.po
Languages: fr

source: =====* Running the first time took `r sprintf("%.3f", t1["elapsed"])` seconds where as the second time took `r sprintf("%.3f", t2["elapsed"])` seconds.=====
fr: =====* L'exécution la première fois a pris `r sprintf("%.3f", t1["elapsed"])` secondes tandis que la deuxième fois, elle a pris `r sprintf("%.3f", t2["elapsed"])` secondes.=====

source: =====* Auto indexing can be disabled by setting the global argument `options(datatable.auto.index = FALSE)`.=====
fr: =====* L'indexation automatique peut être désactivée en définissant l'argument global `options(datatable.auto.index = FALSE)`.=====

source: =====* Disabling auto indexing still allows to use indices created explicitly with `setindex` or `setindexv`. You can disable indices fully by setting global argument `options(datatable.use.index = FALSE)`.=====
fr: =====* Désactiver l'indexation automatique permet toujours d'utiliser les index créés explicitement avec `setindex` ou `setindexv`. Vous pouvez désactiver complètement les index en définissant l'argument global `options(datatable.use.index = FALSE)`.=====

source: #===== r, eval = FALSE ## not run setkey(flights, origin) flights["JFK"] # or flights[.("JFK")]
fr: #===== r, eval = FALSE ## pas exécuté setkey(flights, origin) flights["JFK"] # or flights[.("JFK")]

source: #===== r, eval = FALSE ## not run setkey(flights, dest) flights["LAX"]
fr: #===== r, eval = FALSE ## pas exécuté setkey(flights, dest) flights["LAX"]
