Repository: ChristianWia/rfrench
Catalog: data.table/vignettes/*/po/datatable-secondary-indices-and-auto-indexing.Rmd-*.po
Languages: fr

source: This vignette assumes that the reader is familiar with data.table's `[i, j, by]` syntax, and how to perform fast key based subsets. If you're not familiar with these concepts, please read the *"Introduction to data.table"*, *"Reference semantics"* and *"Keys and fast binary search based subset"* vignettes first.
fr: Cette vignette suppose que le lecteur est familier avec la syntaxe `[i, j, by]` de data.table, et sur la façon d’effectuer des sous-ensembles basés sur des clés rapides. Si vous n'êtes pas familier avec ces concepts, veuillez d'abord lire les vignettes *"Introduction à data.table"*, *"Sémantique de référence"* et *"Sous-ensembles basés sur les clés et la recherche binaire rapide"*.

source: Data {#data}
fr: Données {#data}

source: We will use the same `flights` data as in the *"Introduction to data.table"* vignette.
fr: Nous utiliserons les mêmes données `flights` que dans la vignette *"Introduction à data.table"*.

source: In this vignette, we will
fr: Dans cette vignette, nous allons

source: 1. Secondary indices
fr: 1. Indices secondaires

source: a) What are secondary indices?
fr: a) Qu'est-ce qu'un indice secondaire ?

source: Secondary indices are similar to `keys` in *data.table*, except for two major differences:
fr: Les indices secondaires sont similaires aux `clés` dans *data.table*, à l'exception de deux différences majeures :

source: b) Set and get secondary indices
fr: b) Définir et obtenir des indices secondaires

source: -- How can we set the column `origin` as a secondary index in the *data.table* `flights`?
fr: -- Comment définir la colonne `origin` comme index secondaire dans l’objet *data.table* `flights` ?

source: -- How can we get all the secondary indices set so far in `flights`?
fr: -- Comment obtenir tous les indices secondaires définis jusqu'à présent dans `flights` ?

source: c) Why do we need secondary indices?
fr: c) Pourquoi avons-nous besoin d'indices secondaires ?

source: -- Reordering a data.table can be expensive and not always ideal
fr: -- La réorganisation d'une table de données peut être coûteuse et n'est pas toujours idéale

source: Consider the case where you would like to perform a fast key based subset on `origin` column for the value "JFK". We'd do this as:
fr: Considérons le cas où vous voudriez effectuer un sous-ensemble basé sur une clé rapide sur la colonne `origin` pour la valeur "JFK". Nous ferions cela comme suit :

source: `setkey()` requires:
fr: `setkey()` nécessite de :

source: a) computing the order vector for the column(s) provided, here, `origin`, and
fr: a) calculer le vecteur d'ordre pour la (les) colonne(s) fournie(s), ici, `origin`, et

source: b) reordering the entire data.table, by reference, based on the order vector computed.
fr: b) réordonner l'ensemble du tableau de données, par référence, sur la base du vecteur d'ordre calculé.

source: Computing the order isn't the time consuming part, since data.table uses true radix sorting on integer, character and numeric vectors. However, reordering the data.table could be time consuming (depending on the number of rows and columns).
fr: Le calcul de l'ordre n'est pas la partie qui prend le plus de temps, puisque data.table utilise un vrai tri radix sur les vecteurs d'entiers, de caractères et de nombres. Cependant, réordonner le tableau data.table peut prendre du temps (en fonction du nombre de lignes et de colonnes).

source: Unless our task involves repeated subsetting on the same column, fast key based subsetting could effectively be nullified by the time to reorder, depending on our data.table dimensions.
fr: À moins que notre tâche n'implique un sous-ensemble répété sur la même colonne, le sous-ensemble basé sur une clé rapide pourrait effectivement être annulé par le temps nécessaire pour réorganiser, en fonction des dimensions de notre data.table.

source: -- There can be only one `key` at the most
fr: -- Il ne peut y avoir qu'une seule `clé` au maximum

source: Now if we would like to repeat the same operation but on `dest` column instead, for the value "LAX", then we have to `setkey()`, *again*.
fr: Maintenant, si nous voulons répéter la même opération mais sur la colonne `dest` à la place, pour la valeur "LAX", alors nous devons utiliser `setkey()`, *une fois de plus*.

source: And this reorders `flights` by `dest`, *again*. What we would really like is to be able to perform the fast subsetting by eliminating the reordering step.
fr: Et cela réordonne les `vols` par `dest`, *encore une fois*. Ce que nous aimerions vraiment, c'est pouvoir effectuer le sous-ensemble rapidement en éliminant l'étape de réorganisation.

source: And this is precisely what *secondary indices* allow for!
fr: Et c'est précisément ce que permettent les *indices secondaires* !

source: -- Secondary indices can be reused
fr: -- Les indices secondaires peuvent être réutilisés

source: Since there can be multiple secondary indices, and creating an index is as simple as storing the order vector as an attribute, this allows us to even eliminate the time to recompute the order vector if an index already exists.
fr: Comme il peut y avoir plusieurs indices secondaires et que la création d'un indice est aussi simple que le stockage du vecteur d'ordre en tant qu'attribut, cela nous permet même d'éliminer le temps nécessaire pour recalculer le vecteur d'ordre si un indice existe déjà.

source: -- The new `on` argument allows for cleaner syntax and automatic creation and reuse of secondary indices
fr: -- Le nouvel argument `on` permet une syntaxe plus propre ainsi que la création et la réutilisation automatiques d'indices secondaires

source: As we will see in the next section, the `on` argument provides several advantages:
fr: Comme nous le verrons dans la section suivante, l'argument `on` présente plusieurs avantages :

source: `on` argument
fr: Argument `on`

source: 2. Fast subsetting using `on` argument and secondary indices
fr: 2. Sous-ensemble rapide utilisant l'argument `on` et les indices secondaires

source: a) Fast subsets in `i`
fr: a) Sous-ensembles rapides dans `i`

source: -- Subset all rows where the origin airport matches *"JFK"* using `on`
fr: -- Sous-ensemble de toutes les lignes où l'aéroport d'origine correspond à *"JFK"* en utilisant `on`

source: -- How can I subset based on `origin` *and* `dest` columns?
fr: -- Comment puis-je faire un sous-ensemble basé sur les colonnes `origin` *et* `dest` ?

source: For example, if we want to subset `"JFK", "LAX"` combination, then:
fr: Par exemple, si nous voulons un sous-ensemble combinant `"JFK" et "LAX"`, alors :

source: b) Select in `j`
fr: b) Sélection dans `j`

source: All the operations we will discuss below are no different to the ones we already saw in the *Keys and fast binary search based subset* vignette. Except we'll be using the `on` argument instead of setting keys.
fr: Toutes les opérations que nous allons discuter ci-dessous ne sont pas différentes de celles que nous avons déjà vues dans la vignette *Clé et recherche binaire rapide basée sur un sous-ensemble*. Sauf que nous utiliserons l'argument `on` au lieu de définir des clés.

source: -- Return `arr_delay` column alone as a data.table corresponding to `origin = "LGA"` and `dest = "TPA"`
fr: -- Retourner la colonne `arr_delay` seule en tant que data.table correspondant à `origin = "LGA"` et `dest = "TPA"`

source: c) Chaining
fr: c) Chaînage

source: -- On the result obtained above, use chaining to order the column in decreasing order.
fr: -- Sur la base du résultat obtenu ci-dessus, utilisez le chaînage pour classer la colonne par ordre décroissant.

source: d) Compute or *do* in `j`
fr: d) Calculer ou *do* dans `j`

source: -- Find the maximum arrival delay corresponding to `origin = "LGA"` and `dest = "TPA"`.
fr: -- Trouvez le délai d'arrivée maximal correspondant à `origin = "LGA"` et `dest = "TPA"`.

source: e) *sub-assign* by reference using `:=` in `j`
fr: e) *sous-assignation* par référence en utilisant `:=` dans `j`

source: We have seen this example already in the *Reference semantics* and *Keys and fast binary search based subset* vignette. Let's take a look at all the `hours` available in the `flights` *data.table*:
fr: Nous avons déjà vu cet exemple dans les vignettes *Sémantique des références* et *Clé et sous-ensemble basé sur la recherche binaire rapide*. Regardons toutes les `heures` disponibles dans le *data.table* `flights` :

source: We see that there are totally `25` unique values in the data. Both *0* and *24* hours seem to be present. Let's go ahead and replace *24* with *0*, but this time using `on` instead of setting keys.
fr: Nous constatons qu'il y a au total `25` valeurs uniques dans les données. Les heures *0* et *24* semblent être présentes. Remplaçons *24* par *0*, mais cette fois-ci en utilisant `on` au lieu de définir des clés.

source: Now, let's check if `24` is replaced with `0` in the `hour` column.
fr: Maintenant, vérifions si `24` est remplacé par `0` dans la colonne `hour`.

source: f) Aggregation using `by`
fr: f) Agrégation à l'aide de `by`

source: -- Get the maximum departure delay for each `month` corresponding to `origin = "JFK"`. Order the result by `month`
fr: -- Obtenir le retard maximum au départ pour chaque `mois` correspondant à `origine = "JFK"`. Classer les résultats par `mois`

source: g) The *mult* argument
fr: g) L'argument *mult*

source: The other arguments including `mult` work exactly the same way as we saw in the *Keys and fast binary search based subset* vignette. The default value for `mult` is "all". We can choose, instead only the "first" or "last" matching rows should be returned.
fr: Les autres arguments, y compris `mult`, fonctionnent exactement de la même manière que nous l'avons vu dans la vignette *Keys and fast binary search based subset*. La valeur par défaut de `mult` est "all". Nous pouvons choisir de ne renvoyer que les "premières" ou "dernières" lignes correspondantes.

source: -- Subset only the first matching row where `dest` matches *"BOS"* and *"DAY"*
fr: -- Sous-ensemble contenant uniquement la première ligne correspondante où `dest` correspond à *"BOS"* et *"DAY"*

source: -- Subset only the last matching row where `origin` matches *"LGA", "JFK", "EWR"* and `dest` matches *"XNA"*
fr: -- Sous-ensemble contenant uniquement la dernière ligne correspondante où `origin` correspond à *"LGA", "JFK", "EWR"* et `dest` correspond à *"XNA"*

source: h) The *nomatch* argument
fr: h) L'argument *nomatch*

source: We can choose if queries that do not match should return `NA` or be skipped altogether using the `nomatch` argument.
fr: Nous pouvons choisir si les requêtes qui ne correspondent pas doivent retourner `NA` ou être ignorées en utilisant l'argument `nomatch`.

source: -- From the previous example, subset all rows only if there's a match
fr: -- D'après l'exemple précédent, le sous-ensemble de toutes les lignes n'est pris en compte que s'il y a une correspondance

source: 3. Auto indexing
fr: 3. Indexation automatique

source: First we looked at how to fast subset using binary search using *keys*. Then we figured out that we could improve performance even further and have cleaner syntax by using secondary indices.
fr: Dans un premier temps, nous avons étudié comment effectuer un sous-ensemble rapide à l'aide d'une recherche binaire en utilisant des *clés*. Ensuite, nous avons découvert que nous pouvions améliorer encore les performances et avoir une syntaxe plus propre en utilisant des indices secondaires.

source: That is what *auto indexing* does. At the moment, it is only implemented for binary operators `==` and `%in%`. An index is automatically created *and* saved as an attribute. That is, unlike the `on` argument which computes the index on the fly each time (unless one already exists), a secondary index is created here.
fr: C'est ce que fait l'indexation automatique. Pour l'instant, il n'est implémenté que pour les opérateurs binaires `==` et `%in%`. Un indice est automatiquement créé *et* sauvegardé en tant qu'attribut. C'est-à-dire que contrairement à l'argument `on` qui calcule l'indice à la volée à chaque fois (à moins qu'il n'en existe déjà un), un indice secondaire est créé ici.

source: Let's start by creating a data.table big enough to highlight the advantage.
fr: Commençons par créer un tableau data.table suffisamment grand pour mettre en évidence l'avantage.

source: When we use `==` or `%in%` on a single column for the first time, a secondary index is created automatically, and it is used to perform the subset.
fr: Lorsque nous utilisons `==` ou `%in%` sur une seule colonne pour la première fois, un indice secondaire est créé automatiquement, et il est utilisé pour effectuer le sous-ensemble.

source: The time to subset the first time is the time to create the index + the time to subset. Since creating a secondary index involves only creating the order vector, this combined operation is faster than vector scans in many cases. But the real advantage comes in successive subsets. They are extremely fast.
fr: Le temps nécessaire pour créer un sous-ensemble la première fois est égal au temps nécessaire pour créer l'indice + le temps nécessaire pour créer un sous-ensemble. Étant donné que la création d'un indice secondaire n'implique que la création du vecteur d'ordre, cette opération combinée est plus rapide que les balayages vectoriels dans de nombreux cas. Mais le véritable avantage réside dans les sous-ensembles successifs. Ils sont extrêmement rapides.

source: In recent version we extended auto indexing to expressions involving more than one column (combined with `&` operator). In the future, we plan to extend binary search to work with more binary operators like `<`, `<=`, `>` and `>=`.
fr: Dans la version récente, nous avons étendu l'indexation automatique aux expressions impliquant plus d'une colonne (combinées avec l'opérateur `&`). Dans le futur, nous prévoyons d'étendre la recherche binaire à d'autres opérateurs binaires comme `<`, `<=`, `>` et `>=`.

source: We will discuss fast *subsets* using keys and secondary indices to *joins* in the next vignette, *"Joins and rolling joins"*.
fr: Nous aborderons les *sous-ensembles* rapides utilisant des clés et des indices secondaires pour les *joints* dans la prochaine vignette, *"Joints et jointures roulantes"*.

source: setindex(flights, origin) head(flights) ## alternatively we can provide character vectors to the function 'setindexv()' # setindexv(flights, "origin") # useful to program with # 'index' attribute added names(attributes(flights))
fr: setindex(flights, origin) head(flights) ## nous pouvons aussi fournir des chaînes de caractères à la fonction ‘setindexv()’ # setindexv(flights, "origin") # utile en programmation # attribut 'index' ajouté names(attributes(flights))

source: flights["JFK", on = "origin"] ## alternatively # flights[.("JFK"), on = "origin"] (or) # flights[list("JFK"), on = "origin"]
fr: flights["JFK", on = "origin"] ## ou alors # flights[.("JFK"), on = "origin"] (or) # flights[list("JFK"), on = "origin"]

source: # get all 'hours' in flights flights[, sort(unique(hour))]
fr: # récupère toutes les 'hours' de flights flights[, sort(unique(hour))]

source: ## have a look at all the attribute names names(attributes(dt)) ## run thefirst time (t1 <- system.time(ans <- dt[x == 989L])) head(ans) ## secondary index is created names(attributes(dt)) indices(dt)
fr: ## inspection de tous les noms d’attributs names(attributes(dt)) ## première exécution (t1 <- system.time(ans <- dt[x == 989L])) head(ans) ## indice secondaire créé names(attributes(dt)) indices(dt)

source: ## successive subsets (t2 <- system.time(dt[x == 989L])) system.time(dt[x %in% 1989:2012])
fr: ## sous-ensembles successifs (t2 <- system.time(dt[x == 989L])) system.time(dt[x %in% 1989:2012])

source: title: "Secondary indices and auto indexing" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Secondary indices and auto indexing} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}
fr: title: "Indices secondaires et auto-indexation" date: "`r Sys.Date()`" output: markdown::html_format vignette: > %\VignetteIndexEntry{Indices secondaires et auto-indexation} %\VignetteEngine{knitr::knitr} \usepackage[utf8]{inputenc}

source: Note that `on` argument can also be used on keyed subsets as well. In fact, we encourage providing the `on` argument even when subsetting using keys for better readability.
fr: Notez que l'argument `on` peut également être utilisé pour les sous-ensembles à clés. En fait, nous encourageons à fournir l'argument `on` même lorsque le sous-ensemble utilise des clés pour une meilleure lisibilité.

source: =====* discuss *secondary indices* and provide rationale as to why we need them by citing cases where setting keys is not necessarily ideal,=====
fr: =====* discuter des *indices secondaires* et justifie leur nécessité en citant des cas où l'établissement de clés n'est pas nécessairement idéal,=====

source: =====* perform fast subsetting, once again, but using the new `on` argument, which computes secondary indices internally for the task (temporarily), and reuses if one already exists,=====
fr: =====* effectuer un sous-ensemble rapide, une fois de plus, mais en utilisant le nouvel argument `on`, qui calcule des indices secondaires en interne pour la tâche (temporairement), et les réutilise s'il en existe déjà un,=====

source: =====* and finally look at *auto indexing* which goes a step further and creates secondary indices automatically, but does so on native R syntax for subsetting.=====
fr: =====* et enfin, explorer l’*auto-indexation* qui va plus loin et crée des indices secondaires automatiquement, mais en utilisant la syntaxe native de R pour le sous-ensemble.=====

source: =====* It *doesn't* physically reorder the entire data.table in RAM. Instead, it only computes the order for the set of columns provided and stores that *order vector* in an additional attribute called `index`.=====
fr: =====* Il ne réorganise pas physiquement l'ensemble de la table de données en RAM. Au lieu de cela, il calcule uniquement l'ordre pour l'ensemble des colonnes fournies et stocke ce *vecteur d'ordre* dans un attribut supplémentaire appelé `index`.=====

source: =====* There can be more than one secondary index for a data.table (as we will see below).=====
fr: =====* Il peut y avoir plus d'un index secondaire pour une table de données (comme nous le verrons plus loin).=====

source: =====* `setindex` and `setindexv()` allows adding a secondary index to the data.table.=====
fr: =====* `setindex` et `setindexv()` permettent d'ajouter un index secondaire à data.table.=====

source: =====* Note that `flights` is **not** physically reordered in increasing order of `origin`, as would have been the case with `setkey()`.=====
fr: =====* Notez que `flights` n'est **pas** physiquement réordonné dans l'ordre croissant de `origin`, comme cela aurait été le cas avec `setkey()`.=====

source: =====* Also note that the attribute `index` has been added to `flights`.=====
fr: =====* Notez également que l'attribut `index` a été ajouté à `flights`.=====

source: =====* `setindex(flights, NULL)` would remove all secondary indices.=====
fr: =====* `setindex(flights, NULL)` supprimerait tous les indices secondaires.=====

source: =====* The function `indices()` returns all current secondary indices in the data.table. If none exists, `NULL` is returned.=====
fr: =====* La fonction `indices()` renvoie tous les indices secondaires actuels dans la table data.table. Si aucun n'existe, `NULL` est retourné.=====

source: =====* Note that by creating another index on the columns `origin, dest`, we do not lose the first index created on the column `origin`, i.e., we can have multiple secondary indices.=====
fr: =====* Notez qu'en créant un autre index sur les colonnes `origin, dest`, nous ne perdons pas le premier index créé sur la colonne `origin`, c'est-à-dire que nous pouvons avoir plusieurs index secondaires.=====

source: =====* enables subsetting by computing secondary indices on the fly. This eliminates having to do `setindex()` every time.=====
fr: =====* permet d’effectuer des sous-ensembles en calculant les indices secondaires à la volée. Cela évite d'avoir à faire `setindex()` à chaque fois.=====

source: =====* allows easy reuse of existing indices by just checking the attributes.=====
fr: =====* permet de réutiliser facilement les indices existants en vérifiant simplement les attributs.=====

source: =====* allows for a cleaner syntax by having the columns on which the subset is performed as part of the syntax. This makes the code easier to follow when looking at it at a later point.=====
fr: =====* permet une syntaxe plus propre en intégrant dans la syntaxe les colonnes sur lesquelles le sous-ensemble est effectué. Le code est ainsi plus facile à suivre lorsqu'on le consulte ultérieurement.=====

source: =====* This statement performs a fast binary search based subset as well, by computing the index on the fly. However, note that it doesn't save the index as an attribute automatically. This may change in the future.=====
fr: =====* Cette instruction effectue également une recherche binaire rapide basée sur le sous-ensemble, en calculant l'index à la volée. Cependant, notez qu'elle n'enregistre pas automatiquement l'index en tant qu'attribut. Cela pourrait changer à l'avenir.=====

source: =====* If we had already created a secondary index, using `setindex()`, then `on` would reuse it instead of (re)computing it. We can see that by using `verbose = TRUE`:=====
fr: =====* Si nous avions déjà créé un index secondaire en utilisant `setindex()`, alors `on` le réutiliserait au lieu de le (re)calculer. Nous pouvons le voir en utilisant `verbose = TRUE`:=====

source: =====* `on` argument accepts a character vector of column names corresponding to the order provided to `i-argument`.=====
fr: =====* l’argument `on` accepte un vecteur de caractères de noms de colonnes correspondant à l'ordre fourni à `i-argument`.=====

source: =====* Since the time to compute the secondary index is quite small, we don't have to use `setindex()`, unless, once again, the task involves repeated subsetting on the same column.=====
fr: =====* Comme le temps de calcul de l'index secondaire est assez faible, nous n'avons pas besoin d'utiliser `setindex()`, sauf si, une fois de plus, la tâche implique un sous-ensemble répété sur la même colonne.=====

source: =====* This is particularly a huge advantage of secondary indices. Previously, just to update a few rows of `hour`, we had to `setkey()` on it, which inevitably reorders the entire data.table. With `on`, the order is preserved, and the operation is much faster! Looking at the code, the task we wanted to perform is also quite clear.=====
fr: =====* C'est notamment un énorme avantage des index secondaires. Auparavant, pour mettre à jour quelques lignes de `hour`, nous devions utiliser `setkey()` sur celui-ci, ce qui réorganisait inévitablement l'ensemble de la data.table. Avec `on`, l'ordre est préservé, et l'opération est beaucoup plus rapide ! En inspectant le code, la tâche que nous voulions effectuer est également assez claire.=====

source: =====* We would have had to set the `key` back to `origin, dest` again, if we did not use `on` which internally builds secondary indices on the fly.=====
fr: =====* Nous aurions dû remettre `key` à `origin, dest`, si nous n'avions pas utilisé `on` qui construit en interne des index secondaires à la volée.=====

source: =====* There are no flights connecting "JFK" and "XNA". Therefore, that row is skipped in the result.=====
fr: =====* Aucun vol ne relie "JFK" à "XNA". Par conséquent, cette ligne est ignorée dans le résultat.=====
