Repository: ChristianWia/rfrench
Catalog: data.table/vignettes/*/po/datatable-*-usage.Rmd-*.po
Languages: fr

source: This vignette will explain the most common ways to use the `.SD` variable in your `data.table` analyses. It is an adaptation of [this answer](https://stackoverflow.com/a/47406952/3576984) given on StackOverflow.
fr: Cette vignette explique les manières habituelles d'utiliser la variable `.SD` dans vos analyses de `data.table` . C'est une adaptation ce [cette réponse](https://stackoverflow.com/a/47406952/3576984) donnée sur StackOverflow.

source: What is `.SD`?
fr: C'est quoi `.SD` ?

source: In the broadest sense, `.SD` is just shorthand for capturing a variable that comes up frequently in the context of data analysis. It can be understood to stand for *S*ubset, *S*elfsame, or *S*elf-reference of the *D*ata. That is, `.SD` is in its most basic guise a *reflexive reference* to the `data.table` itself -- as we'll see in examples below, this is particularly helpful for chaining together "queries" (extractions/subsets/etc using `[`). In particular, this also means that `.SD` is *itself a `data.table`* (with the caveat that it does not allow assignment with `:=`).
fr: Au sens large, `.SD` est simplement un raccourci pour capturer une variable qui apparait fréquemment dans le contexte de l'analyse de données. Il faut comprendre *S* pour *S*ubset, *S*elfsame, ou *S*elf-reference et *D* pour *D*onnée. Ce qui donne, `.SD` qui dans sa forme la plus basique est une *référence réflexive* de la `data.table` elle-même -- comme nous le verrons dans les exemples ci-dessous, ceci est particulièrement utile pour chaîner ensemble les "requêtes" (extractions/sous-ensembles/etc... en utilisant `[`). E particulier cela signifie aussi que *`.SD` est lui-même une `data.table`* (avec la mise en garde qu'il ne peut être assigné avec `:=`).

source: The simpler usage of `.SD` is for column subsetting (i.e., when `.SDcols` is specified); as this version is much more straightforward to understand, we'll cover that first below. The interpretation of `.SD` in its second usage, grouping scenarios (i.e., when `by = ` or `keyby = ` is specified), is slightly different, conceptually (though at core it's the same, since, after all, a non-grouped operation is an edge case of grouping with just one group).
fr: L'utilisation la plus simple de `.SD` est pour le sous-ensemble de colonnes (i.e., quand `.SDcols` est spécifié) ; comme cette version est beaucoup plus simple à comprendre, nous allons la couvrir en premier ci-dessous. L'interprétation de `.SD` dans sa seconde utilisation, les scénarios de regroupement (i.e., quand `by = ` ou `keyby = ` est spécifié), est légèrement différente, conceptuellement (bien qu'au fond ce soit la même chose, puisque, après tout, une opération non regroupée est un cas limite de regroupement avec un seul groupe).

source: Loading and Previewing Lahman Data
fr: Charger et afficher les données Lahman

source: To give this a more real-world feel, rather than making up data, let's load some data sets about baseball from the [Lahman database](https://github.com/cdalzell/Lahman). In typical R usage, we'd simply load these data sets from the `Lahman` R package; in this vignette, we've pre-downloaded them directly from the package's GitHub page instead.
fr: Pour donner une impression plus réaliste, plutôt que d'inventer des données, chargeons quelques ensembles de données sur le baseball à partir de la [base de données Lahman] (https://github.com/cdalzell/Lahman). Dans une utilisation classique de R, nous chargerions simplement ces données depuis le package R `Lahman` ; dans cette vignette, nous les avons pré-chargées directement depuis la page GitHub du package.

source: Readers up on baseball lingo should find the tables' contents familiar; `Teams` records some statistics for a given team in a given year, while `Pitching` records statistics for a given pitcher in a given year. Please do check out the [documentation](https://github.com/cdalzell/Lahman) and explore the data yourself a bit before proceeding to familiarize yourself with their structure.
fr: Les lecteurs qui connaissent le jargon du baseball devraient trouver le contenu des tableaux familier ; `Teams` enregistre certaines statistiques pour une équipe donnée au cours d'une année donnée, tandis que `Pitching` enregistre les statistiques pour un lanceur donné au cours d'une année donnée. N'hésitez pas à consulter la [documentation] (https://github.com/cdalzell/Lahman) et à explorer les données vous-même avant de vous familiariser avec leur structure.

source: `.SD` on Ungrouped Data
fr: `.SD` sur des données non groupées

source: To illustrate what I mean about the reflexive nature of `.SD`, consider its most banal usage:
fr: Pour illustrer ce que l'on entend par nature réflexive de `.SD`, considérons son utilisation la plus banale :

source: That is, `Pitching[ , .SD]` has simply returned the whole table, i.e., this was an overly verbose way of writing `Pitching` or `Pitching[]`:
fr: C'est à dire que `Pitching[ , .SD]` a simplement renvoyé la table complète, et c'est une manière exagérément verbeuse d'écrire `Pitching` ou `Pitching[]`:

source: In terms of subsetting, `.SD` is still a subset of the data, it's just a trivial one (the set itself).
fr: En terme de sous-groupe, `.SD` est un sous-groupe des données, le plus évident (c'est l'ensemble lui-même).

source: Column Subsetting: `.SDcols`
fr: Extraction de colonnes : `.SDcols`

source: The first way to impact what `.SD` is is to limit the *columns* contained in `.SD` using the `.SDcols` argument to `[`:
fr: La première façon d'impacter ce que représente `.SD` c'est de limiter les *colonnes* contenues dans `.SD` en utilisant l'argument `.SDcols` dans `[` :

source: This is just for illustration and was pretty boring. In addition to accepting a character vector, `.SDcols` also accepts:
fr: Ceci ne sert que d'illustration et était très ennuyeux. En plus d'accepter un vecteur de caractères `.SDcols` accepte également :

source: any function such as `is.character` to filter *columns*
fr: fonction quelconque comme `is.character` pour filtrer les *colonnes*

source: the function^{*} `patterns()` to filter *column names* by regular expression
fr: la fonction^*^ `patterns()` pour filtrer les *noms des colonnes* avec une expression régulière

source: integer and logical vectors
fr: vecteurs d'entiers et de booléens

source: *see `?patterns` for more details
fr: *voir `?patterns` pour davantage de détails

source: This simple usage lends itself to a wide variety of highly beneficial / ubiquitous data manipulation operations:
fr: Cette simple utilisation permet une large variété d'opérations avantageuses ou équivalentes de manipulation des données :

source: Column Type Conversion
fr: Convertir un type de colonne

source: Column type conversion is a fact of life for data munging. Though [`fwrite` recently gained the ability to declare the class of each column up front](https://github.com/Rdatatable/data.table/pull/2545), not all data sets come from `fread` (e.g. in this vignette) and conversions back and forth among `character`/`factor`/`numeric` types are common. We can use `.SD` and `.SDcols` to batch-convert groups of columns to a common type.
fr: La conversion des types de colonnes est une opération routinière lors du traitement des données. Bien que [`fwrite` ait récemment implémenté la possibilité de déclarer la classe de chaque colonne en amont] (https://github.com/Rdatatable/data.table/pull/2545), tous les jeux de données ne proviennent pas de `fread` (par exemple dans cette vignette) et les conversions entre les types `character`/`factor`/`numeric` sont courantes. Nous pouvons utiliser `.SD` et `.SDcols` pour convertir par lots des groupes de colonnes vers un type commun.

source: We notice that the following columns are stored as `character` in the `Teams` data set, but might more logically be stored as `factor`s:
fr: Remarquons que les colonnes suivantes sont rangées en tant que `character` dans l'ensemble de données `Teams`, mais qu'elles pourraient avantageusement être rangées comme `factor` :

source: The syntax to now convert these columns to `factor` is simple:
fr: La syntaxe pour convertir ces colonnes en `factor` est simple :

source: The `:=` is an assignment operator to update the `data.table` in place without making a copy. See [reference semantics](https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reference-semantics.html) for more.
fr: `:=` est un opérateur d'assignation pour mettre à jour la `data.table` existante sans réaliser de copie. Voir les [sémantiques de référence](https://cran.r-project.org/web/packages/data.table/vignettes/datatable-reference-semantics.html) pour plus d'informations.

source: The LHS, `names(.SD)`, indicates which columns we are updating - in this case we update the entire `.SD`.
fr: Le membre de gauche, `names(.SD)`, indique les colonnes à mettre à jour - dans ce cas il s'agit de tout le `.SD`.

source: The RHS, `lapply()`, loops through each column of the `.SD` and converts the column to a factor.
fr: Le membre droit `lapply()`, boucle sur chaque colonne de `.SD` et convertit la colonne en facteur.

source: We use the `.SDcols` to only select columns that have pattern of `teamID`.
fr: Nous utilisons `.SDcols` pour sélectionner uiquement les colonnes qui ont pour modèle `teamID`.

source: Again, the `.SDcols` argument is quite flexible; above, we supplied `patterns` but we could have also supplied `fkt` or any `character` vector of column names. In other situations, it is more convenient to supply an `integer` vector of column *positions* or a `logical` vector dictating include/exclude for each column. Finally, the use of a function to filter columns is very helpful.
fr: A nouveau, l'argument `.SDcols` est très souple ; nous avons fourni ci-dessus `patterns` mais nous aurions pu passer également `fkt` ou tout vecteur `character` de noms de colonnes. Dans d'autres situations, il est plus pratique de fournir un vecteur `integer` de *positions* des colonnes ou un vecteur de `booléens` indiquant pour chaque colonne s'il faut l'inclure ou l'exclure. Finalement nous utilisons une fonction pour filtrer les colonnes ce qui est très pratique.

source: For example, we could do the following to convert all `factor` columns to `character`:
fr: Par exemple nous pourrions faire ceci pour convertir toutes les colonnes `factor` en `character` :

source: Lastly, we can do pattern-based matching of columns in `.SDcols` to select all columns which contain `team` back to `factor`:
fr: Enfin, nous pouvons faire une correspondance basée sur les motifs des colonnes dans `.SDcols` pour sélectionner toutes les colonnes qui contiennent `team` vers `factor` :

source: ** A proviso to the above: *explicitly* using column numbers (like `DT[ , (1) := rnorm(.N)]`) is bad practice and can lead to silently corrupted code over time if column positions change. Even implicitly using numbers can be dangerous if we don't keep smart/strict control over the ordering of when we create the numbered index and when we use it.
fr: ** Une réserve à ce qui précède : *l'utilisation explicite* de numéros de colonnes (comme `DT[ , (1) := rnorm(.N)]`) est une mauvaise pratique et peut conduire à un code corrompu sans aucun message d’avertissement au fil du temps si les positions des colonnes changent. Même l'utilisation implicite de nombres peut être dangereuse si nous ne gardons pas un contrôle intelligent/strict sur l'ordre dans lequel nous créons l'index numéroté et quand nous l'utilisons.

source: Controlling a Model's Right-Hand Side
fr: Contrôler le membre droit d'un modèle

source: Varying model specification is a core feature of robust statistical analysis. Let's try and predict a pitcher's ERA (Earned Runs Average, a measure of performance) using the small set of covariates available in the `Pitching` table. How does the (linear) relationship between `W` (wins) and `ERA` vary depending on which other covariates are included in the specification?
fr: La variation de la spécification du modèle est une caractéristique essentielle de l'analyse statistique robuste. Essayons de prédire l'ERA (Earned Runs Average, une mesure de performance) d'un lanceur en utilisant le petit ensemble de covariables disponibles dans le tableau `Pitching`. Comment la relation (linéaire) entre `W` (victoires) et `ERA` varie-t-elle en fonction des autres covariables incluses dans la spécification ?

source: Here's a short script leveraging the power of `.SD` which explores this question:
fr: Voici une courte description qui évalue la puissance de `.SD` explorant cette question :

source: The coefficient always has the expected sign (better pitchers tend to have more wins and fewer runs allowed), but the magnitude can vary substantially depending on what else we control for.
fr: Le coefficient a toujours le signe attendu (les meilleurs lanceurs ont tendance à avoir plus de victoires et moins de tours autorisés), mais l'amplitude peut varier substantiellement en fonction de ce qui est contrôlé par ailleurs.

source: Conditional Joins
fr: Jointures conditionnelles

source: `data.table` syntax is beautiful for its simplicity and robustness. The syntax `x[i]` flexibly handles three common approaches to subsetting -- when `i` is a `logical` vector, `x[i]` will return those rows of `x` corresponding to where `i` is `TRUE`; when `i` is *another `data.table`* (or a `list`), a (right) `join` is performed (in the plain form, using the `key`s of `x` and `i`, otherwise, when `on = ` is specified, using matches of those columns); and when `i` is a character, it is interpreted as shorthand for `x[list(i)]`, i.e., as a join.
fr: la syntaxe `data.table` est magnifique pour sa simplicité et sa robustesse. La syntaxe `x[i]` gère de manière flexible trois approches communes du sous-ensemble -- quand `i` est un vecteur `logique`, `x[i]` retournera les lignes de `x` correspondant à l'endroit où `i` est `TRUE` ; quand `i` est *un autre `data.table`* (ou une `liste`), une `jonction` (droite) est effectuée (dans la forme normale, en utilisant les `clés` de `x` et `i`, sinon, quand `on = ` est spécifié, en utilisant les correspondances de ces colonnes) ; et quand `i` est un caractère, il est interprété comme un raccourci pour `x[list(i)]`, c'est-à-dire..., comme une jointure.

source: This is great in general, but falls short when we wish to perform a *conditional join*, wherein the exact nature of the relationship among tables depends on some characteristics of the rows in one or more columns.
fr: C'est très bien en général, mais ce n'est pas suffisant lorsque nous souhaitons effectuer une "jointure conditionnelle", dans laquelle la nature exacte de la relation entre les tables dépend de certaines caractéristiques des lignes dans une ou plusieurs colonnes.

source: This example is admittedly a tad contrived, but illustrates the idea; see here ([1](https://stackoverflow.com/questions/31329939/conditional-keyed-join-update-and-update-a-flag-column-for-matches), [2](https://stackoverflow.com/questions/29658627/conditional-binary-join-and-update-by-reference-using-the-data-table-package)) for more.
fr: Cet exemple est certes un peu artificiel, mais il illustre l'idée ; voir ici ([1](https://stackoverflow.com/questions/31329939/conditional-keyed-join-update-and-update-a-flag-column-for-matches), [2](https://stackoverflow.com/questions/29658627/conditional-binary-join-and-update-by-reference-using-the-data-table-package)) pour plus d'informations.

source: The goal is to add a column `team_performance` to the `Pitching` table that records the team's performance (rank) of the best pitcher on each team (as measured by the lowest ERA, among pitchers with at least 6 recorded games).
fr: L'objectif est d'ajouter une colonne `team_performance` à la table `Pitching` qui enregistre la performance de l'équipe (rang) du meilleur lanceur de chaque équipe (mesurée par l'ERA la plus basse, parmi les lanceurs ayant au moins 6 matchs enregistrés).

source: Note that the `x[y]` syntax returns `nrow(y)` values (i.e., it's a right join), which is why `.SD` is on the right in `Teams[.SD]` (since the RHS of `:=` in this case requires `nrow(Pitching[rank_in_team == 1])` values).
fr: Notez que la syntaxe `x[y]` renvoie des valeurs `nrow(y)` (c'est-à-dire qu'il s'agit d'une jointure à droite), ce qui explique pourquoi `.SD` est à droite dans `Teams[.SD]` (puisque le RHS de `:=` dans ce cas requiert des valeurs `nrow(Pitching[rank_in_team == 1])`).

source: Grouped `.SD` operations
fr: Opérations `.SD` groupées

source: Often, we'd like to perform some operation on our data *at the group level*. When we specify `by =` (or `keyby = `), the mental model for what happens when `data.table` processes `j` is to think of your `data.table` as being split into many component sub-`data.table`s, each of which corresponds to a single value of your `by` variable(s):
fr: Souvent, nous aimerions effectuer une opération sur nos données *au niveau du groupe*. Quand nous spécifions `by =` (ou `keyby = `), le modèle mental pour ce qui se passe quand `data.table` traite `j` est de penser à votre `data.table` comme étant divisé en de nombreux composants sous `data.table`, chacun d'entre eux correspondant à une seule valeur de votre (vos) variable(s) `by` :

source: ![Grouping, Illustrated](plots/grouping_illustration.png)
fr: ![Regroupement, illustré](../plots/grouping_illustration.png)

source: In the case of grouping, `.SD` is multiple in nature -- it refers to *each* of these sub-`data.table`s, *one-at-a-time* (slightly more accurately, the scope of `.SD` is a single sub-`data.table`). This allows us to concisely express an operation that we'd like to perform on *each sub-`data.table`* before the re-assembled result is returned to us.
fr: Dans le cas du regroupement, `.SD` est multiple par nature -- il se réfère à *chacun* de ces sous-`data.table`s, *un-à-la-fois* (un peu plus précisément, la portée de `.SD` est une seule sous-`data.table`). Cela nous permet d'exprimer de manière concise une opération que nous aimerions effectuer sur *chaque sous-`data.table`* avant que le résultat ré-assemblé ne nous soit retourné.

source: This is useful in a variety of settings, the most common of which are presented here:
fr: C'est utile pour diverses initialisations, les plus communes sont présentées ici :

source: Group Subsetting
fr: Sous-groupes

source: Let's get the most recent season of data for each team in the Lahman data. This can be done quite simply with:
fr: Essayons d'obtenir la saison la plus récente des données pour chaque équipe des données Lahman. Ceci peut être fait simplement avec :

source: Recall that `.SD` is itself a `data.table`, and that `.N` refers to the total number of rows in a group (it's equal to `nrow(.SD)` within each group), so `.SD[.N]` returns the *entirety of `.SD`* for the final row associated with each `teamID`.
fr: Rappelons que `.SD` est lui-même un `data.table`, et que `.N` fait référence au nombre total de lignes dans un groupe (il est égal à `nrow(.SD)` dans chaque groupe), donc `.SD[.N]` retourne l'*entité de `.SD`* pour la dernière ligne associée à chaque `teamID`.

source: Another common version of this is to use `.SD[1L]` instead to get the *first* observation for each group, or `.SD[sample(.N, 1L)]` to return a *random* row for each group.
fr: Une autre version commune de ceci est l'utilisation de `.SD[1L]` à la place, pour obtenir la *première* observation de chaque groupe, ou `.SD[sample(.N, 1L)]` pour renvoyer une ligne *aléatoire* pour chaque groupe.

source: Group Optima
fr: Groupe Optima

source: Suppose we wanted to return the *best* year for each team, as measured by their total number of runs scored (`R`; we could easily adjust this to refer to other metrics, of course). Instead of taking a *fixed* element from each sub-`data.table`, we now define the desired index *dynamically* as follows:
fr: Supposons que nous voulions retourner la *meilleure* année pour chaque équipe, mesurée par le nombre total de runs marqués (`R` ; nous pourrions facilement ajuster ceci pour faire référence à d'autres métriques, bien sûr). Au lieu de prendre un élément *fixe* de chaque sous-`data.table`, nous définissons maintenant l'index désiré *dynamiquement* comme suit :

source: Note that this approach can of course be combined with `.SDcols` to return only portions of the `data.table` for each `.SD` (with the caveat that `.SDcols` should be fixed across the various subsets)
fr: Notez que cette approche peut bien sûr être combinée avec `.SDcols` pour renvoyer uniquement les portions de `data.table` pour chaque `.SD` (avec la mise en garde que `.SDcols` soit initialisé en fonction des différents sous-ensembles)

source: *NB*: `.SD[1L]` is currently optimized by [*`GForce`*](https://Rdatatable.gitlab.io/data.table/library/data.table/html/datatable-optimize.html) ([see also](https://stackoverflow.com/questions/22137591/about-gforce-in-data-table-1-9-2)), `data.table` internals which massively speed up the most common grouped operations like `sum` or `mean` -- see `?GForce` for more details and keep an eye on/voice support for feature improvement requests for updates on this front: [1](https://github.com/Rdatatable/data.table/issues/735), [2](https://github.com/Rdatatable/data.table/issues/2778), [3](https://github.com/Rdatatable/data.table/issues/523), [4](https://github.com/Rdatatable/data.table/issues/971), [5](https://github.com/Rdatatable/data.table/issues/1197), [6](https://github.com/Rdatatable/data.table/issues/1414)
fr: *NB* : `.SD[1L]` est actuellement optimisé par [*`GForce`*](https://Rdatatable.gitlab.io/data.table/library/data.table/html/datatable-optimize.html) ([voir aussi](https://stackoverflow.com/questions/22137591/about-gforce-in-data-table-1-9-2)), `data.table` interne qui accélère massivement les opérations groupées les plus courantes comme `sum` ou `mean` -- voir ` ?GForce` pour plus de détails et gardez un oeil sur le support pour les demandes d'amélioration des fonctionnalités pour les mises à jour sur ce front : [1](https://github.com/Rdatatable/data.table/issues/735), [2](https://github.com/Rdatatable/data.table/issues/2778), [3](https://github.com/Rdatatable/data.table/issues/523), [4](https://github.com/Rdatatable/data.table/issues/971), [5](https://github.com/Rdatatable/data.table/issues/1197), [6](https://github.com/Rdatatable/data.table/issues/1414)

source: Grouped Regression
fr: Régression groupée

source: Returning to the inquiry above regarding the relationship between `ERA` and `W`, suppose we expect this relationship to differ by team (i.e., there's a different slope for each team). We can easily re-run this regression to explore the heterogeneity in this relationship as follows (noting that the standard errors from this approach are generally incorrect -- the specification `ERA ~ W*teamID` will be better -- this approach is easier to read and the *coefficients* are OK):
fr: Pour revenir à la question ci-dessus concernant la relation entre `ERA` et `W`, supposons que nous nous attendions à ce que cette relation diffère selon l'équipe (c'est-à-dire qu'il y ait une pente différente pour chaque équipe). Nous pouvons facilement réexécuter cette régression pour explorer l'hétérogénéité de cette relation comme suit (en notant que les erreurs standard de cette approche sont généralement incorrectes - la spécification `ERA ~ W*teamID` sera meilleure - cette approche est plus facile à lire et les *coefficients* sont corrects) :

source: While there is indeed a fair amount of heterogeneity, there's a distinct concentration around the observed overall value.
fr: Tandis qu'il existe une grande hétérogénéité, la concentration autour de la valeur générale observée reste très distincte.
