Repository: ChristianWia/rfrench
Catalog: Rcmdr/Survival plugin/R-*.po
Languages: fr

source: Cox-Regression Model
fr: Modèle de régression de Cox

source: Start and stop times must be ordered.
fr: Les temps de début et de fin doivent être ordonnés.

source: You must select one or two time variables.
fr: Vous devez sléectionner une ou deux variables.

source: You must select an event indicator.
fr: Vous devez sélection un indicateur d'événement.

source: "%s" is not a valid name.
fr: "%s" n'est pas un nom correct.

source: <all valid cases>
fr: <tous cas corrects>

source: Right-hand side of model empty.
fr: Partie de droite du modèle vide.

source: Model
fr: Modèle

source: Enter name for model:
fr: Nom du modèle :

source: Time or start/end times (select one or two)
fr: Temps ou début/fin (sélectionnez-en un ou deux)

source: Event indicator (select one)
fr: Indicateur d'événement (sélectionnez-en un)

source: Strata (select zero or more)
fr: Strate (Sélectionnez-en une ou rien)

source: Clusters (optional)
fr: Groupes (optionnel)

source: Method for Ties
fr: Méthode pour les ex-aequos

source: Default
fr: Par défaut

source: Yes
fr: Oui

source: No
fr: Non

source: Robust Standard Errors
fr: Ecarts types robustes

source: Survival Data Definition
fr: Définition des données de survie

source: Plot Cox-Model Survival Functions
fr: Graphe des fonction du modèle de survie de Cox

source: Default behavior
fr: Comportement par défaut

source: Plot Confidence Intervals
fr: Graphe des intervalles de confiance

source: Plot at predictor means
fr: Graphe aux moyennes des prédictions

source: Plot by factor levels at covariate means
fr: Graphe par niveaux de la variable facteur aux moyennes de la covariable

source: Plot at specified values of predictors
fr: Graphe à des valeurs spécifiées des prédictions

source: Type of Plot
fr: Type de graphe

source: Confidence level must be a number between 0 and 1.
fr: Le niveau de confiance doit être un nombre compris entre 0 et 1.

source: Number of valid entries in prediction data (%d) not equal to number of rows (%d) * number of columns (%d).
fr: Le nombre d'entrées correctes dans les données de prédiction (%d) n'est pas égal au nombre de lignes (%d) * le nombre de colonnes (%d).

source: Level of confidence:
fr: Niveau de confiance :

source: Plot marginal survival
fr: Graphe de la survie marginale

source: Specify Values of Predictors:
fr: Spécifier les valeurs des prédictions :

source: Number of rows:
fr: Nombre de lignes :

source: Compare Survival Functions
fr: Comper des fonctions de survie

source: You must select strata.
fr: Vous devez sélectionner des strates.

source: Survival Function
fr: Fonction de survie

source: Plain
fr: Normale

source: None
fr: Aucune

source: Confidence Intervals
fr: Intervalles de confiance

source: Plot confidence Intervals
fr: Graphe des intervalles de confiance

source: Mark censoring times
fr: Mrquer les temps censorés

source: Method
fr: Méthode

source: Variance Method
fr: Méthode de la variance

source: Confidence level
fr: Niveau de confiance

source: Quantiles to estimate
fr: Quantiles à estimer

source: Survival Regression Model
fr: Modèle de régression de survie

source: Exponential
fr: Exponentiel

source: Gaussian
fr: Gaussien

source: Logistic
fr: Logistique

source: Log-logistic
fr: Log-logistique

source: Reshape Wide Survival Data to Long
fr: Reformatter des données de survie large en longueur

source: No time-varying covariates specified.
fr: Aucune covariable variant avec le temps n'est spécifiée.

source: You must enter the name of a data set.
fr: Vous devez entrer le nom d'un jeu de données.

source: is not a valid name.
fr: n'est pas un nom correct.

source: Data set
fr: Jeu de données

source: You must select a time-to-event variable.
fr: Vous devez sélectionner une variable time-to-event.

source: Covariate set has %d entries; should have %d entries
fr: La covariabloe choisie a %d entrées ; Elle devrait en avoir %d

source: Covariate set must have at least 2 entries.
fr: La covariable choisie doit avoir au moins 2 entrées.

source: Time to event (select one)
fr: Temps de l'événement (sélectionnez-en un)

source: Select set of time-dependent covariates
fr: Sélectionnez l'ensemble des/ncovariables dépendant du temps

source: Select
fr: Sélectionnez

source: Enter name for data set:
fr: Nom du jeu de données :

source: Name for covariate
fr: Nom de la covariable

source: tcltk package missing
fr: package tcltk manquant

source: all elements of cov must be of the same length and
fr: tous les éléments de cov doivent être de même longueur et

source: cov.times must have one more entry than each element of cov.
fr: cov.times doit contenir une ou plus d'entrées que chaque élément de cov.

source: event indicator must have values {0, 1}, {1, 2} or {FALSE, TRUE}
fr: l'indicateur d'événement doit avoir des valeurs {0, 1}, {1, 2} ou {FALSE, TRUE}

source: Factors only
fr: Variables facteurs seulement

source: All variables
fr: Toutes les variables

source: Candidates for clusters
fr: Candidats pour les regroupements

source: Time-dependent covariates
fr: Covariables dépendant du temps

source: <none defined>
fr: <aucun défini>

source: Convert variable to date...
fr: Convertir la variable en date ...

source: Date Conversion
fr: Conversion en date

source: Variable to convert
fr: Variable à convertir

source: Date format
fr: Format de date

source: Name for date variable
fr: Nom de la variable date

source: Class of date variable
fr: Classe de la variable date

source: object
fr: objet

source: Estimate survival function...
fr: Estimer la fonction de survie...

source: Compare survival functions...
fr: Comparer les fonctions de survie...

source: Survival analysis
fr: Analyse de survie

source: Survival data definition...
fr: Définition des données de survie...

source: Convert wide to long data...
fr: Convertir des données larges en données longues...

source: Survival data
fr: Données de survie

source: Cox regression model...
fr: Modèle de régression de Cox...

source: Parametric survival model...
fr: Modèle paramétrique de survie...

source: Test proportional hazards
fr: Test des risques proportionnels

source: Cox-model survival function...
fr: Fonction de survie du modèle de Cox...

source: Plot terms in Cox model
fr: Graphe des termes du modèle de survie de Cox

source: Plot survival-regression dfbetas
fr: Graphique de la régression de survie dfbetas

source: Plot survival-regression dfbeta
fr: Graphique de la régression de survie dfbeta

source: Plot null Martingale residuals
fr: Graphique des résidus de Martingale nuls

source: Cox-model partial-residual plots
fr: Graphiques des résidus partiels du modèle de Cox

source: Event indicator (select one or none)
fr: Indicateur d'événement (sélectionnez-en un ou aucun)

source: Type of Censoring
fr: Type de censure

source: Right
fr: Droite

source: Left
fr: Gauche

source: Interval
fr: Intervalle

source: Counting
fr: Contage

source: Interval type 2
fr: Intervalle de type 2

source: You must select an event indicator if censoring is 'interval'.
fr: Vous devez sélectionner un indicateur d'événement si la censure est 'interval'.

source: You should not select an event indicator if censoring is 'interval2'.
fr: Vous ne devez pas sélectionner un indicateur d'événement si la censure est 'interval2'.

source: start-end times only for counting-process or interval censoring.
fr: les heures de début et de fin uniquement pour le processus de comptage ou la censure par intervalle.

source: start-end times required for counting-process or interval censoring.
fr: les temps de début et de fin requis pour le processus de comptage ou la censure par intervalle.

source: Strata (select one or more)
fr: Strate (Sélectionnez-en une ou plusieurs)

source: Summary
fr: Résumé

source: Detailed
fr: Détaillé

source: Data
fr: Jeu de données
